# 序列化
    # json
        # json类型 : '{"key":[1,2,3]}'
        # 所有语言通用的\支持的数据类型有限
        # 序列化的结果是字符串 : 可视化
        # json不支持多次dump
    # pickle
        # python自己用\支持python中几乎所有的数据类型
        # 结果是二进制 :看不懂的
        # pickle天生支持多次dump和load
# 面向对象
    # 类 class 类型
        # 类变量
        # 实例方法 __init__ attack bite
        # 类指针 - 指向父类
    # 对象
        # 对象指针
        # 实例变量 self.name slef.age
    # 组合
        # 一个对象作为一个属性
        # self.course = python
    # 继承
        # class Foo:pass
        # class Son(Foo):pass
        # Son是子类\派生类  Foo是父类\超类\基类
        # 继承的特点:
            # 如果多个类都用到了相同的方法\属性
            # 我们应该把这些共用的方法抽象到他们的父类中去
            # 减少代码的冗余
        # 先写子类的功能,发现重复才创建父类
        # 子类自己没有某一个方法或者属性的时候用父类的
            # 如果自己有 还像用父类的 在子类中直接调用父类的方法就可以了
