# 1.注册一个账号,创建一个自己的博客主页
# 你的博客主页贴给我们的
# 每一周-两周 有一篇产出

# 2.递归函数 - 三级菜单
#   递归函数 - 二分查找

# 3.random 实现一个验证码,可以是4位或者6位,可以是纯数字,数字+字母


# 大作业:re模块和正则表达式 循环 不推荐用递归
exp = '1 - 2 * ( (60-30 +(-40/5) * (9-2*5/3 + 7 /3*99/4*2998 +10 * 568/14 )) - (-4*3)/ (16-3*2) )'
# exp = 2*3
# exp = 2+3
# exp = 2-3
# exp = 2/3

# 2+3*5

# print(eval(exp))
# 通过正则表达式 匹配出"内部不再有小括号的表达式" 9-10/3 + 7 /3*99/4*2998 +10 * 568/14
# 匹配第一个乘法或者除法 '2*5'
# 计算这个表达式的结果
# 循环一直到所有的乘除法都计算完毕

# 处理加减法
# 匹配第一个乘法或者除法 '2*5'
# 计算这个表达式的结果
# 循环一直到加减法也都计算完毕

# 基本需求 :只考虑整数 和 加减乘除四则运算
# 进阶需求 :考虑小数 和 加减乘除+()