date = {
    '北京市':{
            "昌平":{
                "沙河":{"腾讯","华为","小米","老男孩"},
                "天通苑":{"百度","链家","我爱我家"}
            },
            "朝阳":{
                "望京":{"奔驰","宝马","福特"},
                "东直门":{"华硕","阿里巴巴","京东"}
            },
            "立水桥":{
                "医院":{"上善医院","航空总院","仁和医院"},
                "商场":{"万优汇","龙德商场","尚品佳"}
        }
    },

    '内蒙古':{
            "锡林浩特":{
                "正蓝旗":{"手抓羊肉","马奶酒","闷倒驴"},
                 "家乡风景区":{"元都遗址","金莲川","小札格斯"}
         }
    },

     '河北省': {
            "张家口":{"工业街","北方机电","张北草原"},
             "张北县":{"草原天路","玻璃栈道","森林公园"}
            }
}

n = [date]
while n:
    for key in n[-1]:print(key)
    k = input('input>>>>>')
    if k in n [-1].keys() and n [-1][k]:n.append(n[-1][k])
    elif k == 'b':n.pop()
    elif k == 'q':break