# 知识点回顾
# 解释性语言 ：写好的代码，交给解释器，就可以运行起来
# IDE：集成开发工具（pycharm、sublime）
# 基本数据类型
    # bool值 ： True真 False假
    # int   整数 ： +-*/ // % (算术运算) > < >= <= ==(比较运算)
        # % 取余
            # num%2 == 0 偶数
            # num%2 == 1 奇数
            # 分页
    # float 小数 算术运算 比较运算
    # str字符串
        # 要显示出来给人看的
        # print input('输入的提示 ：')
        # 'hello' "hello"   显示单行
        # '''hello'''  """hello"""  显示多行
    # 数据类型之间的转换
        # num = 5
        # s = str(num)  # '5'
        # s2 = '5'
        # n2 = int(s2)
        # s3 = '5.4'
        # f3 = float(s3)
        # 想把一个变量转换成某一个类型
        # 新的类型的变量 = 类型名(变量)
# 变量
# 常量 - 符合变量的命名规则，全大写
# 注释
    # 井号
    # 三引号
# 输入输出
    # print() 打印给用户看、输出
    # input() 输入给计算机去操作
# 运算符
    # +-*/ // % (算术运算)
    # > < >= <= ==(比较运算)
# 条件判断
    # if 条件1:
        # 满足条件1要执行的代码
    # elif 条件2:
        # 满足条件2要执行的代码
    # elif 条件3:
        # 满足条件3要执行的代码
    # ...
    # else:
        # 上面所有的条件都不满足要执行的代码
# while循环
    # while 条件:
        # 要循环的代码

# 循环不明白
# n = 0
# while n<5:    # 结束条件 条件不满足的时候就结束了
#     print(n)
#     n = n+1
# 一般情况下 永远是某一个语法自带一个:
# 这个:之后总是要缩进
# 你希望写在这个语法范围内的代码都要缩进

# n = 0
# while n <5:
#     if n % 2 == 0:
#         print('偶数 : ', n)
#     else:
#         print('奇数 : ', n)
#     n = n+1

# 习题讲解
# 双色球
# 先让用户依次选择6个红球（红球的选择范围是1-32）
n = 0
s1 = ''
while n < 6:
    num1 = input('请输入红球的号码 :')
    num = int(num1)
    if num <= 32 and num >= 1:
        print('您选择了红球',num1)  # '23' ,'24'
        n = n + 1
        if n < 6:
            s1 = s1 + num1 +','  # '23,'+'24'+',' = '23,24,25,26,27,'
        else:
            s1 = s1 + num1    # '23,24,25,26,27,'+'28'
    else:
        print('请选择1-32之间的数字')
m = 0
s2 = ''
while m < 2:
    num2 = input('请输入蓝球的号码 ：')
    num = int(num2)
    if num <= 16 and num >= 1:
        print('您选择了蓝球', num2)
        m = m + 1
        if m<2:
            s2 = s2 + num2 + ','  # 除最后一个数字以外的拼接
        else:
            s2 = s2 + num2   # 最后一个数字的拼接
    else:
        print('请选择1-16之间的数字')
print('您选择的红球有 ：',s1)
print('您选择的蓝球有 ：',s2)







